cf_billing/DataProcessors/энргСостояниеУслугСтроенийМенеджер.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>энргСостояниеУслугСтроенийМенеджер</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

cf_billing/InformationRegisters/энргАктивностьТочекУчетаМКД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргАктивностьТочекУчетаМКД</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.энргСостояниеТочекУчета</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МКД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСтроения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТочкаУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргТочкиУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/энргУслугиТочекУчетаМКД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргУслугиТочекУчетаМКД</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МКД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСтроения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТочкаУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргТочкиУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/энргПоставщикиУслугМКД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргПоставщикиУслугМКД</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргКонтрагенты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МКД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСтроения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТочкаУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргТочкиУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЧастьСоставной</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/энргТУМКДНаСтруктуреСети.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргТУМКДНаСтруктуреСети</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СтруктураСети</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бестСтруктураСети</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Строение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСтроения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТочкаУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргТочкиУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/DataProcessors/энргСостояниеУслугСтроенийМенеджер/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс 

// Получает действующие услуги строения.
//
// Параметры:
//  Организация			-	СправочникСсылка.Организации.
//  Район				-	СправочникСсылка.энргЗоныОтвественности.
//  МКД					-	СправочникСсылка.энргСтроения.
//  ПолучаемыеСвойства	-	Структура.
//  Период				-	Дата.
// 
// Возвращаемое значение:
//   РезультатЗапроса.
//
Функция ДействующиеУслугиСтроения(Организация,Район,МКД,ПолучаемыеСвойства = "",Период = Неопределено) Экспорт 
	
	Если ОбщегоНазначения.ПодсистемаСуществует("слжСлужебная") Тогда
		слжОбщегоНазначенияМодуль 	= ОбщегоНазначения.ОбщийМодуль("слжОбщегоНазначения");
		Если слжОбщегоНазначенияМодуль.ВоспроизводитьРезультатМетодов() Тогда; 
			Если НЕ Метаданные.Обработки.Найти("слжСостояниеУслугСтроенийМенеджер") = Неопределено Тогда
				Возврат Обработки["слжСостояниеУслугСтроенийМенеджер"].ДействующиеУслугиСтроения(Организация,Район,МКД,Период);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	мПолучаемыеСвойства 			= СтрРазделить(ПолучаемыеСвойства,",",Ложь);
	Схема 							= Неопределено;
	ПараметрыСхемы 					= Новый Структура;
	ПараметрыЗапроса 				= Новый Структура("Организация,Район,МКД",Организация,Район,МКД);
	Если Не Период = Неопределено Тогда
		ПараметрыСхемы.Вставить("Период", энргФормированиеТекстовЗапроса.ПараметрПериодРавно("Период"));
		ПараметрыЗапроса.Вставить("Период", Период);
	КонецЕсли;
	
	ПараметрыВТ 					= Новый Массив;
	ПараметрыВТ.Добавить(энргФормированиеТекстовЗапроса.ПараметрТипРавно(Новый Структура("Организация,Район,МКД,Строение","Организация","Район","МКД","МКД")));
	
	РегистрыСведений.энргАктивностьТочекУчетаМКД.АктивныеТочкиУчета(Схема,ПараметрыСхемы,"ДействующиеТочкиУчета");
	РегистрыСведений.энргУслугиТочекУчетаМКД.УслугиДействующихТочек(Схема,ПараметрыСхемы,"УслугиДействующихТочек");
	РегистрыСведений.энргПоставщикиУслугМКД.ЗаполнитьСхемуПоставщикиУслугМКД(Схема,ПараметрыСхемы,"ПоставщикиУслугМКД");
	
	Если НЕ мПолучаемыеСвойства.Найти("СтруктураСети") = Неопределено Тогда
		РегистрыСведений.энргТУМКДНаСтруктуреСети.ЗаполнитьСхемуСтруктураСетиДействующихТочек(Схема,ПараметрыСхемы,"СтруктураСетиДействующихТочек");
	КонецЕсли;  	
	
	Пакет 							= Схема.ПакетЗапросов.Добавить();
	Пакет.УстановитьТекстЗапроса(ТекстЗапросаДействующиеУслугиСтроения());
	
	Если НЕ мПолучаемыеСвойства.Найти("СтруктураСети") = Неопределено Тогда
		ГлавныйОператорВыбора  		= Пакет.Операторы[0];
		ИсточникВложенныйЗапрос 	= ГлавныйОператорВыбора.Источники[0].Источник.Запрос;
		ОператорВложенного 			= ИсточникВложенныйЗапрос.Операторы[0];
		ВторойВложенныйИсточник 	= ОператорВложенного.Источники[0].Источник.Запрос;
		ОператорВыбора 				= ВторойВложенныйИсточник.Операторы[0];
		ИсточникСтруктураСети 		= ОператорВыбора.Источники.Добавить("СтруктураСетиДействующихТочек");
		
		мУсловияСоединения 			= Новый Массив;
		мУсловияСоединения.Добавить("ДействующиеТочкиУчета.Организация = СтруктураСетиДействующихТочек.Организация");
		мУсловияСоединения.Добавить("ДействующиеТочкиУчета.Район = СтруктураСетиДействующихТочек.Район");
		мУсловияСоединения.Добавить("ДействующиеТочкиУчета.МКД = СтруктураСетиДействующихТочек.МКД");
		мУсловияСоединения.Добавить("ДействующиеТочкиУчета.ТочкаУчета = СтруктураСетиДействующихТочек.ТочкаУчета");
		
		Соединение 					= ОператорВыбора.Источники[0].Соединения.Добавить("СтруктураСетиДействующихТочек",СтрСоединить(мУсловияСоединения,Символы.ПС + " И "));
		ОператорВыбора.ВыбираемыеПоля.Добавить("ЕСТЬNULL(СтруктураСетиДействующихТочек.СтруктураСети, Значение(Справочник.бестСтруктураСети.ПустаяСсылка))");
		КолонкаЗапроса  			= ВторойВложенныйИсточник.Колонки[ВторойВложенныйИсточник.Колонки.Количество()-1];
		КолонкаЗапроса.Псевдоним 	= "СтруктураСети";
		
		ОператорВложенного.ВыбираемыеПоля.Добавить("ВложенныйЗапрос.СтруктураСети");
		КолонкаЗапроса  			= ИсточникВложенныйЗапрос.Колонки[ИсточникВложенныйЗапрос.Колонки.Количество()-1];
		КолонкаЗапроса.Псевдоним 	= "СтруктураСети";
		
		ГлавныйОператорВыбора.ВыбираемыеПоля.Добавить("ВложенныйЗапрос.СтруктураСети");
		КолонкаЗапроса  			= Пакет.Колонки[Пакет.Колонки.Количество()-1];
		КолонкаЗапроса.Псевдоним 	= "СтруктураСети";
	КонецЕсли;
	
	Результат						= энргСхемаЗапросаСервер.ВыполнитьЗапрос(Схема,ПараметрыЗапроса);;
	
	Если ОбщегоНазначения.ПодсистемаСуществует("слжСлужебная") Тогда
		ИмяМетода 					= "СостояниеУслугСтроенийМенеджер.ДействующиеУслугиСтроения";
		ПараметрыМетода 			= Новый Структура("Организация,Район,МКД,Период", Организация,Район,МКД,Период);
		слжОбщегоНазначенияМодуль 	= ОбщегоНазначения.ОбщийМодуль("слжОбщегоНазначения");
		слжОбщегоНазначенияМодуль.Логгер().ЗаписатьРезультатЗапросаКодом(ИмяМетода, Результат);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ТекстЗапросаДействующиеУслугиСтроения()
	Текст  =
	"ВЫБРАТЬ
	|	ВложенныйЗапрос.Организация КАК Организация,
	|	ВложенныйЗапрос.Район КАК Район,
	|	ВложенныйЗапрос.МКД КАК МКД,
	|	ВложенныйЗапрос.ТочкаУчета КАК ТочкаУчета,
	|	ВложенныйЗапрос.СоставнаяУслуга КАК СоставнаяУслуга,
	|	ВложенныйЗапрос.Услуга КАК Услуга,
	|	ВложенныйЗапрос.ЧастьСоставной КАК ЧастьСоставной,
	|	ЕСТЬNULL(ПоставщикиУслугМКД.Поставщик, ЗНАЧЕНИЕ(Справочник.энргКонтрагенты.ПустаяСсылка)) КАК Поставщик
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВложенныйЗапрос.Организация КАК Организация,
	|		ВложенныйЗапрос.Район КАК Район,
	|		ВложенныйЗапрос.МКД КАК МКД,
	|		ВложенныйЗапрос.ТочкаУчета КАК ТочкаУчета,
	|		ЕСТЬNULL(энргВидыУслугСоставляющиеУслуг.Ссылка, ЗНАЧЕНИЕ(Справочник.энргВидыУслуг.ПустаяСсылка)) КАК СоставнаяУслуга,
	|		ВЫБОР
	|			КОГДА энргВидыУслугСоставляющиеУслуг.Ссылка ЕСТЬ NULL
	|				ТОГДА ВложенныйЗапрос.Услуга
	|			ИНАЧЕ энргВидыУслугСоставляющиеУслуг.Услуга
	|		КОНЕЦ КАК Услуга,
	|		ВЫБОР
	|			КОГДА энргВидыУслугСоставляющиеУслуг.Ссылка ЕСТЬ NULL
	|				ТОГДА ЛОЖЬ
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ КАК ЧастьСоставной
	|	ИЗ
	|		(ВЫБРАТЬ
	|			ДействующиеТочкиУчета.Организация КАК Организация,
	|			ДействующиеТочкиУчета.Район КАК Район,
	|			ДействующиеТочкиУчета.МКД КАК МКД,
	|			ДействующиеТочкиУчета.ТочкаУчета КАК ТочкаУчета,
	|			ЕСТЬNULL(УслугиДействующихТочек.Услуга, ЗНАЧЕНИЕ(Справочник.энргВидыУслуг.ПустаяСсылка)) КАК Услуга
	|		ИЗ
	|			ДействующиеТочкиУчета КАК ДействующиеТочкиУчета
	|				ЛЕВОЕ СОЕДИНЕНИЕ УслугиДействующихТочек КАК УслугиДействующихТочек
	|				ПО ДействующиеТочкиУчета.Организация = УслугиДействующихТочек.Организация
	|					И ДействующиеТочкиУчета.Район = УслугиДействующихТочек.Район
	|					И ДействующиеТочкиУчета.МКД = УслугиДействующихТочек.МКД
	|					И ДействующиеТочкиУчета.ТочкаУчета = УслугиДействующихТочек.ТочкаУчета) КАК ВложенныйЗапрос
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргВидыУслуг.СоставляющиеУслуг КАК энргВидыУслугСоставляющиеУслуг
	|			ПО ВложенныйЗапрос.Услуга = энргВидыУслугСоставляющиеУслуг.Ссылка) КАК ВложенныйЗапрос
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПоставщикиУслугМКД КАК ПоставщикиУслугМКД
	|		ПО ВложенныйЗапрос.Организация = ПоставщикиУслугМКД.Организация
	|			И ВложенныйЗапрос.Район = ПоставщикиУслугМКД.Район
	|			И ВложенныйЗапрос.МКД = ПоставщикиУслугМКД.МКД
	|			И ВложенныйЗапрос.ТочкаУчета = ПоставщикиУслугМКД.ТочкаУчета
	|			И ВложенныйЗапрос.Услуга = ПоставщикиУслугМКД.Услуга
	|			И ВложенныйЗапрос.ЧастьСоставной = ПоставщикиУслугМКД.ЧастьСоставной";	
	Возврат Текст;
	
КонецФункции

#КонецОбласти

#КонецЕсли
